fixture/charges/charge_with_card.json

[
  {
    "request": {
      "body": "{\"card_number\":\"4111111111111111\",\"cvv2\":\"110\",\"expiration_month\":\"12\",\"expiration_year\":\"25\",\"holder_name\":\"Juan Perez Ramirez\"}",
      "headers": {
        "Authorization": "Basic c2tfZGEwNWRjOTg2MDVkNGUxZDg4MDU4MmI0ZWU2MjFlODQ6",
        "Content-Type": "application/json",
        "Accept": "application/json; Charset=utf-8"
      },
      "method": "post",
      "options": {
        "ssl_options": {
          "versions": [
            "tlsv1.2"
          ]
        },
        "recv_timeout": 10000
      },
      "request_body": "",
      "url": "https://sandbox-api.openpay.mx/v1/mjtkrswiqtxftemz4tgl/tokens"
    },
    "response": {
      "binary": false,
      "body": "{\"id\":\"kapkasobeqda41aymxcd\",\"card\":{\"card_number\":\"411111XXXXXX1111\",\"holder_name\":\"Juan Perez Ramirez\",\"expiration_year\":\"25\",\"expiration_month\":\"12\",\"address\":null,\"creation_date\":null,\"brand\":\"visa\"}}",
      "headers": {
        "Date": "Wed, 03 Feb 2021 22:14:39 GMT",
        "Content-Type": "application/json;charset=utf-8",
        "Content-Length": "204",
        "Connection": "keep-alive",
        "OpenPay-Request-ID": "df56ec82-0a0b-44a1-853b-a62067c0ffdd",
        "Cache-Control": "no-cache, no-store, max-age=0, must-revalidate",
        "Pragma": "no-cache",
        "Expires": "0",
        "Strict-Transport-Security": "max-age=31536000 ; includeSubDomains",
        "X-XSS-Protection": "1; mode=block",
        "X-Frame-Options": "DENY",
        "X-Content-Type-Options": "nosniff",
        "Resource-ID": "kapkasobeqda41aymxcd",
        "Location": "https://sandbox-api.openpay.mx/v1/mjtkrswiqtxftemz4tgl/tokens/kapkasobeqda41aymxcd"
      },
      "status_code": 201,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "{\"amount\":748.0,\"capture\":true,\"currency\":\"MXN\",\"customer\":{\"creation_date\":null,\"email\":\"juan.vazquez@empresa.com.mx\",\"external_id\":null,\"id\":null,\"last_name\":\"Vazquez Juarez\",\"name\":\"Juan\",\"phone_number\":\"4423456723\",\"requires_account\":false},\"cvv2\":110,\"description\":\"Cargo inicial a mi cuenta\",\"device_session_id\":\"kR1MiQhz2otdIuUlQkbEyitIqVMiI16f\",\"metadata\":null,\"method\":\"card\",\"order_id\":\"000051612390479\",\"payment_plan\":null,\"source_id\":\"kapkasobeqda41aymxcd\"}",
      "headers": {
        "Authorization": "Basic c2tfZGEwNWRjOTg2MDVkNGUxZDg4MDU4MmI0ZWU2MjFlODQ6",
        "Content-Type": "application/json",
        "Accept": "application/json; Charset=utf-8"
      },
      "method": "post",
      "options": {
        "ssl_options": {
          "versions": [
            "tlsv1.2"
          ]
        },
        "recv_timeout": 10000
      },
      "request_body": "",
      "url": "https://sandbox-api.openpay.mx/v1/mjtkrswiqtxftemz4tgl/charges"
    },
    "response": {
      "binary": false,
      "body": "{\"id\":\"trzegc9bpb4nuop0fzvu\",\"authorization\":\"801585\",\"operation_type\":\"in\",\"transaction_type\":\"charge\",\"card\":{\"type\":\"debit\",\"brand\":\"visa\",\"address\":null,\"card_number\":\"411111XXXXXX1111\",\"holder_name\":\"Juan Perez Ramirez\",\"expiration_year\":\"25\",\"expiration_month\":\"12\",\"allows_charges\":true,\"allows_payouts\":true,\"bank_name\":\"Banamex\",\"bank_code\":\"002\"},\"status\":\"completed\",\"conciliated\":false,\"creation_date\":\"2021-02-03T16:14:41-06:00\",\"operation_date\":\"2021-02-03T16:14:43-06:00\",\"description\":\"Cargo inicial a mi cuenta\",\"error_message\":null,\"order_id\":\"000051612390479\",\"currency\":\"MXN\",\"amount\":748.00,\"customer\":{\"name\":\"Juan\",\"last_name\":\"Vazquez Juarez\",\"email\":\"juan.vazquez@empresa.com.mx\",\"phone_number\":\"4423456723\",\"address\":null,\"creation_date\":\"2021-02-03T16:14:41-06:00\",\"external_id\":null,\"clabe\":null},\"fee\":{\"amount\":24.19,\"tax\":3.8704,\"currency\":\"MXN\"},\"method\":\"card\"}",
      "headers": {
        "Date": "Wed, 03 Feb 2021 22:14:47 GMT",
        "Content-Type": "application/json;charset=utf-8",
        "Content-Length": "894",
        "Connection": "keep-alive",
        "OpenPay-Request-ID": "6da0c957-adc5-49a2-b1db-be593eece9a7",
        "Cache-Control": "no-cache, no-store, max-age=0, must-revalidate",
        "Pragma": "no-cache",
        "Expires": "0",
        "Strict-Transport-Security": "max-age=31536000 ; includeSubDomains",
        "X-XSS-Protection": "1; mode=block",
        "X-Frame-Options": "DENY",
        "X-Content-Type-Options": "nosniff",
        "Resource-ID": "trzegc9bpb4nuop0fzvu",
        "Location": "https://sandbox-api.openpay.mx/v1/mjtkrswiqtxftemz4tgl/charges/trzegc9bpb4nuop0fzvu"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]